bonus_case/app/Controllers/Instansi.php

SELECT *
FROM `pengguna`
WHERE `nama_pengguna` = 'admin'
 LIMIT 1
SELECT *
FROM `instansi`
---
    public function index(){
        $pengguna = $this->penggunaModel->where('nama_pengguna', $this->session->get('nama_pengguna'))->first();
        $data = [
            'title'         => 'Daftar Instansi',
            'instansi'      => $this->instansiModel->findAll(),

SELECT *
FROM `pengguna`
WHERE `nama_pengguna` = 'admin'
 LIMIT 1
---
    public function tambah(){
        $pengguna = $this->penggunaModel->where('nama_pengguna', $this->session->get('nama_pengguna'))->first();

INSERT INTO `instansi` (`nama_instansi`, `deskripsi_instansi`) VALUES ('Instansi A', 'Tester')
---
    public function simpan(){
        $data = [
            'nama_instansi'          => filter_var($this->request->getPost('nama_instansi'), FILTER_SANITIZE_STRING),
            'deskripsi_instansi'     => filter_var($this->request->getPost('deskripsi_instansi'), FILTER_SANITIZE_STRING),
        ];
        if($this->validation->run($data, 'instansi') == FALSE){
            $this->session->setFlashdata('errors', $this->validation->getErrors());
            return redirect()->to(base_url('instansi/tambah'))->withInput();
        } else {
            $this->instansiModel->insert($data);

SELECT *
FROM `pengguna`
WHERE `nama_pengguna` = 'admin'
 LIMIT 1
SELECT *
FROM `instansi`
WHERE `instansi`.`id_instansi` = '1'
---
    public function ubah($id_instansi){
        $pengguna = $this->penggunaModel->where('nama_pengguna', $this->session->get('nama_pengguna'))->first();
        $data = [
            'title'         => 'Ubah Instansi',
            'instansi'      => $this->instansiModel->find($id_instansi),

UPDATE `instansi` SET `nama_instansi` = 'Instansi B', `deskripsi_instansi` = 'Test lagi'
WHERE `instansi`.`id_instansi` IN ('1')
---
    public function perbarui($id_instansi){
        $data = [
            'nama_instansi'          => filter_var($this->request->getPost('nama_instansi'), FILTER_SANITIZE_STRING),
            'deskripsi_instansi'     => filter_var($this->request->getPost('deskripsi_instansi'), FILTER_SANITIZE_STRING),
        ];
        if($this->validation->run($data, 'instansi') == FALSE){
            $this->session->setFlashdata('errors', $this->validation->getErrors());
            return redirect()->to(base_url('instansi/'.$id_instansi.'/ubah'))->withInput();
        } else {
            $this->instansiModel->update($id_instansi, $data);

DELETE FROM `instansi`
WHERE `id_instansi` IN ('1')
---
    public function hapus($id_instansi){
        $this->instansiModel->delete($id_instansi);